### pandas is a python library used for data cleaning, analysis, manipulation
### works like xl but faster
### helps  load, clean, filter, analyze data
### uses: dara science,ml,finance,analytics

In [17]:
import pandas as pd
import numpy as np
pd.__version__

'2.0.3'

#             Pandas data structures
### Series- one dimensional column
### DataFrames- Table with rows and columns

In [4]:
s=pd.Series([10,20,30])
print(s)

0    10
1    20
2    30
dtype: int64

In [21]:
df=pd.DataFrame({
    "name":["Kav","nihas"],
    "age":[23,45]
})
df

    name  age
0    Kav   23
1  nihas   45

# Reading csv

In [8]:
df=pd.read_csv(r"C:\Users\yvsur\ML internship\kav.csv")
df

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu
5    yamuna   12    kakinada
6      devi   87         kkd
7    akhila   55         ptp
8   neelima   34         ptp
9      rani   32         xys

In [47]:
df=pd.read_csv("kav.csv")
df

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu
5    yamuna   12    kakinada
6      devi   87         kkd
7    akhila   55         ptp
8   neelima   34         ptp
9      rani   32         xys

# writing data into files

In [44]:
df=pd.read_csv(r"C:\Users\yvsur\ML internship\kav.csv")

In [54]:
df.to_csv("niha.csv",index=False)
df

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu
5    yamuna   12    kakinada
6      devi   87         kkd
7    akhila   55         ptp
8   neelima   34         ptp
9      rani   32         xys

In [54]:
df.to_csv("niha.csv",index=False)
df

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu
5    yamuna   12    kakinada
6      devi   87         kkd
7    akhila   55         ptp
8   neelima   34         ptp
9      rani   32         xys

In [55]:
df.head() #first five

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu

In [56]:
df.tail() #last five

      name  age      city
5   yamuna   12  kakinada
6     devi   87       kkd
7   akhila   55       ptp
8  neelima   34       ptp
9     rani   32       xys

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   age     10 non-null     int64
 2   city    10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [58]:
df.head(3)

       name  age        city
0     durga   16    samalkot
1    kaveri   32  peddapuram
2  niharika   45    kakinada

In [60]:
df['name'][df['city']=='samalkot'] #gives name that match the condition of city is samalkot

0    durga
Name: name, dtype: object

In [61]:
df[2:5]

       name  age        city
2  niharika   45    kakinada
3    sweety   78    kakinada
4     prash   34  prathipadu

In [62]:
df.columns

Index(['name', 'age', 'city'], dtype='object')

In [63]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [64]:
df.dtypes

name    object
age      int64
city    object
dtype: object

In [69]:
df.name #column name

0       durga
1      kaveri
2    niharika
3      sweety
4       prash
5      yamuna
6        devi
7      akhila
8     neelima
9        rani
Name: name, dtype: object

In [70]:
df.age

0    16
1    32
2    45
3    78
4    34
5    12
6    87
7    55
8    34
9    32
Name: age, dtype: int64

In [71]:
df['name']

0       durga
1      kaveri
2    niharika
3      sweety
4       prash
5      yamuna
6        devi
7      akhila
8     neelima
9        rani
Name: name, dtype: object

In [1]:
df[['name','age']] #gives more than one column

NameError: name 'df' is not defined

In [ ]:
df.shape() #rows and columns

# Missing values

In [75]:
df.isnull()

    name    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [93]:
df=pd.DataFrame({
    "name":["pavan","mani","kumar"],
    "Age":[33,44,None]
})
df

    name   Age
0  pavan  33.0
1   mani  44.0
2  kumar   NaN

In [79]:
df.isnull().sum() #total missing values

name    0
Age     1
dtype: int64

In [80]:
df[df.isnull().any(axis=1)] #SHOW rows with missing values

    name  Age
2  kumar  NaN

In [91]:
df['Age']=df['Age'].fillna(df['Age'].mean()) #fills the missing or null vales
df

    name   Age
0  pavan  33.0
1   mani  44.0
2  kumar  38.5

In [97]:
df_clean=df.dropna()
df_clean

    name   Age
0  pavan  33.0
1   mani  44.0

In [12]:
import pandas as pd
df=pd.DataFrame({
    "name":["pavan","mani","pavan"],
    "Age":[44,55,44]
})
df

    name  Age
0  pavan   44
1   mani   55
2  pavan   44

In [13]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [14]:
df[df.duplicated()]

    name  Age
2  pavan   44

In [15]:
df.drop_duplicates()

    name  Age
0  pavan   44
1   mani   55

 # Sumary statistics

In [24]:
import pandas as pd
df=pd.read_csv("kav.csv")
df

       name  age        city  marks
0     durga   16    samalkot     56
1    kaveri   32  peddapuram     57
2  niharika   45    kakinada     58
3    sweety   78    kakinada     59
4     prash   34  prathipadu     60
5    yamuna   12    kakinada     61
6      devi   87         kkd     62
7    akhila   55         ptp     63
8   neelima   34         ptp     64
9      rani   32         xys     65

In [10]:
df['age'].max()

87

In [12]:
df['age'].min()

12

In [13]:
df['age'].mean()

42.5

In [14]:
df['age'].describe()

count    10.000000
mean     42.500000
std      24.496031
min      12.000000
25%      32.000000
50%      34.000000
75%      52.500000
max      87.000000
Name: age, dtype: float64

In [22]:
import pandas as pd
df[df.age==df.age.max()]
df

    name  age
0    Kav   23
1  nihas   45

In [23]:
df.count()

name    2
age     2
dtype: int64

In [26]:
df.name[df.marks==df.marks.max()]

9    rani
Name: name, dtype: object

In [28]:
df['city'].nunique()

7

In [29]:
df['city'].value_counts()

city
kakinada      3
ptp           2
samalkot      1
peddapuram    1
prathipadu    1
kkd           1
xys           1
Name: count, dtype: int64

# String cleaning

In [3]:
import pandas as pd
df=pd.read_csv(r"C:\Users\yvsur\ML internship\kav.csv")
df

       name  age        city  marks
0     durga   16    samalkot     56
1    kaveri   32  peddapuram     57
2  niharika   45    kakinada     58
3    sweety   78    kakinada     59
4     prash   34  prathipadu     60
5    yamuna   12    kakinada     61
6      devi   87         kkd     62
7    akhila   55         ptp     63
8   neelima   34         ptp     64
9      rani   32         xys     65

In [4]:
df['city']=df['city'].str.upper()
df

       name  age        city  marks
0     durga   16    SAMALKOT     56
1    kaveri   32  PEDDAPURAM     57
2  niharika   45    KAKINADA     58
3    sweety   78    KAKINADA     59
4     prash   34  PRATHIPADU     60
5    yamuna   12    KAKINADA     61
6      devi   87         KKD     62
7    akhila   55         PTP     63
8   neelima   34         PTP     64
9      rani   32         XYS     65

In [5]:
df['city']=df['city'].str.lower()
df

       name  age        city  marks
0     durga   16    samalkot     56
1    kaveri   32  peddapuram     57
2  niharika   45    kakinada     58
3    sweety   78    kakinada     59
4     prash   34  prathipadu     60
5    yamuna   12    kakinada     61
6      devi   87         kkd     62
7    akhila   55         ptp     63
8   neelima   34         ptp     64
9      rani   32         xys     65

In [19]:
df['city'].str.lower()

0       mumbai
1     banglore
2    hyderabad
0      chicago
1      newyork
2       orland
Name: city, dtype: object

In [8]:
df['city']=df['city'].str.replace("xys","chennai")
df

       name  age        city  marks
0     durga   16    samalkot     56
1    kaveri   32  peddapuram     57
2  niharika   45    kakinada     58
3    sweety   78    kakinada     59
4     prash   34  prathipadu     60
5    yamuna   12    kakinada     61
6      devi   87         kkd     62
7    akhila   55         ptp     63
8   neelima   34         ptp     64
9      rani   32     chennai     65

# concate Data Frame

In [10]:
india_weather=pd.DataFrame({
    "city":["mumbai","banglore","hyderabad"],
    "temperature":[34,23,44]
})
india_weather

        city  temperature
0     mumbai           34
1   banglore           23
2  hyderabad           44

In [13]:
us_weather= pd.DataFrame({
    "city":["chicago","Newyork","orland"],
    "temperature":[45,12,76]
})
us_weather

      city  temperature
0  chicago           45
1  Newyork           12
2   orland           76

In [17]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature
0     mumbai           34
1   banglore           23
2  hyderabad           44
0    chicago           45
1    Newyork           12
2     orland           76

In [20]:
df=pd.concat([india_weather,us_weather],ignore_index=True) # it gives line by line ignore index true means it follows ordered index
df

        city  temperature
0     mumbai           34
1   banglore           23
2  hyderabad           44
3    chicago           45
4    Newyork           12
5     orland           76

In [21]:
df=pd.concat([india_weather,us_weather],axis=1) # it gives side by side tabless
df

        city  temperature     city  temperature
0     mumbai           34  chicago           45
1   banglore           23  Newyork           12
2  hyderabad           44   orland           76

# Merge dataframes

In [39]:
temp_df=pd.DataFrame({
    "city":["hybd","vzg","vijaywada"],
    "temperature":[34,56,21]
})
temp_df

        city  temperature
0       hybd           34
1        vzg           56
2  vijaywada           21

In [42]:
hum_df=pd.DataFrame({
    "city":["chicago","Newyork","vzg"],
    "humidity":[45,12,76]
})
hum_df

      city  humidity
0  chicago        45
1  Newyork        12
2      vzg        76

In [43]:
df=pd.merge(temp_df,hum_df,on="city") # it merges and gives common clm
df

  city  temperature  humidity
0  vzg           56        76

In [44]:
df=pd.merge(temp_df,hum_df,on="city",how="outer") # it gives all with null values
df

        city  temperature  humidity
0       hybd         34.0       NaN
1        vzg         56.0      76.0
2  vijaywada         21.0       NaN
3    chicago          NaN      45.0
4    Newyork          NaN      12.0

In [45]:
df.isnull()

    city  temperature  humidity
0  False        False      True
1  False        False     False
2  False        False      True
3  False         True     False
4  False         True     False

In [46]:
df.isnull().sum()

city           0
temperature    2
humidity       2
dtype: int64

In [47]:
df["temperature"]=df["temperature"].fillna(df.temperature.min())

In [48]:
df.isnull()

    city  temperature  humidity
0  False        False      True
1  False        False     False
2  False        False      True
3  False        False     False
4  False        False     False

In [49]:
df

        city  temperature  humidity
0       hybd         34.0       NaN
1        vzg         56.0      76.0
2  vijaywada         21.0       NaN
3    chicago         21.0      45.0
4    Newyork         21.0      12.0

In [50]:
df["humidity"]=df["humidity"].fillna(df.humidity.min())
df

        city  temperature  humidity
0       hybd         34.0      12.0
1        vzg         56.0      76.0
2  vijaywada         21.0      12.0
3    chicago         21.0      45.0
4    Newyork         21.0      12.0